In [93]:
# Import nesscary libraries.

import pandas as pd
import numpy as np

In [94]:
# Read CSV 1 file, convert into dataframe.

# The URL link to view the csv file in GitHub is "https://github.com/jaabberwocky/dataeng_test/blob/master/dataset1.csv".
# The raw dataset link is "https://raw.githubusercontent.com/jaabberwocky/dataeng_test/master/dataset1.csv". - Remember to remove "/blob".

csv_file1_url = "https://raw.githubusercontent.com/jaabberwocky/dataeng_test/master/dataset1.csv"

In [95]:
csv1_df = pd.read_csv(csv_file1_url, sep=',')
csv1_df.head()

             name       price
0   William Dixon  109.037280
1    Kristen Horn  262.524652
2  Kimberly Chang  187.007258
3       Mary Ball  283.174648
4  Benjamin Craig  143.871582

In [96]:
# Read CSV 2 file, convert into dataframe.

# The URL link to view the csv file in GitHub is "https://github.com/jaabberwocky/dataeng_test/blob/master/dataset2.csv".
# The raw dataset link is "https://raw.githubusercontent.com/jaabberwocky/dataeng_test/master/dataset2.csv". - Remember to remove "/blob".

csv_file2_url = "https://raw.githubusercontent.com/jaabberwocky/dataeng_test/master/dataset2.csv"

In [97]:
csv2_df = pd.read_csv(csv_file2_url, sep=',')
csv2_df.head()

                 name        price
0      William Garcia  258.1809089
1     Barbara Freeman   141.890534
2   Rebecca Zimmerman   293.373272
3  Patricia Velasquez  249.9479246
4        Ronnie Clark   272.908659

In [98]:
# Combine the 2 dataframes into 1 dataframe.

combined_csv = pd.concat([csv1_df, csv2_df])

# Check the number of rows in the new dataframe.

len(combined_csv)

10000

In [99]:
# Check the number of missing values in the combined_csv.

combined_csv.isnull().sum()

name     39
price     0
dtype: int64

In [100]:
# Only 'name' column have missing value. So remove rows which do not have a name.

combined_csv = combined_csv.dropna()

In [101]:
# Check the number of missing values in the combined_csv again.

combined_csv.isnull().sum()

name     0
price    0
dtype: int64

In [102]:
# After the removal, check the number of rows in the new dataframe again.
# By right, the number of rows should be 9961 (10000-39).

len(combined_csv)

9961

In [103]:
# Remove the old index (with "drop=True"), recount new index values and add into the dataframe.

combined_csv.reset_index(drop=True)

                 name        price
0       William Dixon      109.037
1        Kristen Horn      262.525
2      Kimberly Chang      187.007
3           Mary Ball      283.175
4      Benjamin Craig      143.872
...               ...          ...
9956     Rachel Davis  95.25395533
9957  Connie Hamilton  205.3966853
9958      Sean Kaiser  80.54737145
9959  Ebony Rodriguez  93.20561606
9960  Gregg Alexander   297.046886

[9961 rows x 2 columns]

In [104]:
# Check the datatype of the 2 columns.

combined_csv.dtypes

name     object
price    object
dtype: object

In [105]:
# Check the name suffixes/titles/prefixes in name column.

print('Count "Mr." :', combined_csv.name.str.contains('Mr. ').sum())
print('Count "Mrs.":', combined_csv.name.str.contains('Mrs. ').sum())
print('Count "Ms." :', combined_csv.name.str.contains('Ms. ').sum())
print('Count "Miss":', combined_csv.name.str.contains('Miss ').sum())
print('Count "Dr." :', combined_csv.name.str.contains('Dr. ').sum())
print('Count "PhD" :', combined_csv.name.str.contains(' PhD').sum())
print('Count "MD"  :', combined_csv.name.str.contains(' MD').sum())
print('Count "DDS" :', combined_csv.name.str.contains(' DDS').sum())
print('Count "DVM" :', combined_csv.name.str.contains(' DVM').sum())
print('Count "II"  :', combined_csv.name.str.contains(' II').sum())
print('Count "III" :', combined_csv.name.str.contains(' III').sum())
print('Count "IV"  :', combined_csv.name.str.contains(' IV').sum())
print('Count "Jr." :', combined_csv.name.str.contains(' Jr.').sum())

Count "Mr." : 43
Count "Mrs.": 48
Count "Ms." : 13
Count "Miss": 11
Count "Dr." : 54
Count "PhD" : 22
Count "MD"  : 92
Count "DDS" : 63
Count "DVM" : 40
Count "II"  : 9
Count "III" : 4
Count "IV"  : 1
Count "Jr." : 17

In [106]:
# Remove all the suffix/titles.

combined_csv['name'] = combined_csv['name'].str.replace('Mr. |Mrs. |Ms. |Miss |Dr. | PhD| MD| DDS| DVM| II| III| IV| Jr.', "", regex=True)

In [107]:
# Count the suffix/titles in name column again.

print('Count "Mr." :', combined_csv.name.str.contains('Mr. ').sum())
print('Count "Mrs.":', combined_csv.name.str.contains('Mrs. ').sum())
print('Count "Ms." :', combined_csv.name.str.contains('Ms. ').sum())
print('Count "Miss":', combined_csv.name.str.contains('Miss ').sum())
print('Count "Dr." :', combined_csv.name.str.contains('Dr. ').sum())
print('Count "PhD" :', combined_csv.name.str.contains(' PhD').sum())
print('Count "MD"  :', combined_csv.name.str.contains(' MD').sum())
print('Count "DDS" :', combined_csv.name.str.contains(' DDS').sum())
print('Count "DVM" :', combined_csv.name.str.contains(' DVM').sum())
print('Count "II"  :', combined_csv.name.str.contains(' II').sum())
print('Count "III" :', combined_csv.name.str.contains(' III').sum())
print('Count "IV"  :', combined_csv.name.str.contains(' IV').sum())
print('Count "Jr." :', combined_csv.name.str.contains(' Jr.').sum())

Count "Mr." : 0
Count "Mrs.": 0
Count "Ms." : 0
Count "Miss": 0
Count "Dr." : 0
Count "PhD" : 0
Count "MD"  : 0
Count "DDS" : 0
Count "DVM" : 0
Count "II"  : 0
Count "III" : 0
Count "IV"  : 0
Count "Jr." : 0

In [108]:
# Check the number of rows again.

len(combined_csv)

9961

In [112]:
# Spilt 'name' column into 'first_name' and 'last_name' new columns.

firstname_lastname = combined_csv['name'].str.split(' ', 1, expand=True)

combined_csv['first_name'] = firstname_lastname[0]
combined_csv['last_name'] = firstname_lastname[1]

# Drop the 'name' column.

combined_csv.drop(columns = ["name"], inplace = True)

# Check first 5 records.
combined_csv.head()

     price first_name last_name
0  109.037    William     Dixon
1  262.525    Kristen      Horn
2  187.007   Kimberly     Chang
3  283.175       Mary      Ball
4  143.872   Benjamin     Craig

In [113]:
# Convert price datatype from object to float. Round off to 2 decimal places.
combined_csv['price'] = combined_csv["price"].astype(float).round(2)

# Check first 5 records.
combined_csv.head()

    price first_name last_name
0  109.04    William     Dixon
1  262.52    Kristen      Horn
2  187.01   Kimberly     Chang
3  283.17       Mary      Ball
4  143.87   Benjamin     Craig

In [114]:
# New column - "above_100"
combined_csv["above_100"] = np.where(combined_csv["price"] > 100.00, True, False)

In [116]:
# Check first 15 records.
combined_csv.head(15)

     price first_name last_name  above_100
0   109.04    William     Dixon       True
1   262.52    Kristen      Horn       True
2   187.01   Kimberly     Chang       True
3   283.17       Mary      Ball       True
4   143.87   Benjamin     Craig       True
5    61.51      Cathy    Werner      False
6    48.64    Brandon      Bell      False
7    12.39       Paul    Farley      False
8   151.60      Sarah  Mcdaniel       True
9    75.62   Caroline  Anderson      False
10  147.03       Carl     Jones       True
11  244.19      Scott       Lee       True
12   17.86     Kaylee   Coleman      False
13  215.54    Charles    Parker       True
14   38.36      Susan      Hess      False

In [117]:
# Export dataframe into CSV file.
combined_csv.to_csv('dataset_result.csv', index=False)